In [1]:
import pandas as pd
import datetime as dt

In [3]:
##datetime is module in python language

## Review of Python's datetime Module

In [9]:
somedate = dt.date(2016, 4, 12)

In [11]:
somedate

datetime.date(2016, 4, 12)

In [14]:
somedate.year
somedate.month
somedate.day

12

In [23]:
sometime = dt.datetime(2010,1,10, 17, 13, 54)
sometime

datetime.datetime(2010, 1, 10, 17, 13, 54)

In [20]:
str(somedate)

'2016-04-12'

In [25]:
sometime.day
sometime.second

54

In [26]:
str(sometime)

'2010-01-10 17:13:54'

## The pandas Timestamp Object

In [28]:
##pandas version of datetime

In [35]:
pd.Timestamp("2015-03-31")
pd.Timestamp("2015/03/31")
pd.Timestamp("2013, 4, 4")
pd.Timestamp("1/1/2015")
pd.Timestamp("19/12/2014")
pd.Timestamp("2012-03-08 08:35:15")
pd.Timestamp("2104-04-05 06:10:23 PM")

Timestamp('2104-04-05 18:10:23')

In [36]:
pd.Timestamp(somedate)

Timestamp('2016-04-12 00:00:00')

In [37]:
pd.Timestamp(dt.date(2016,4,3))

Timestamp('2016-04-03 00:00:00')

## The pandas DateTimeIndex Object

In [40]:
dates = ["2016-01-02", "2019-09-17"]
dtindex = pd.DatetimeIndex(dates)

In [42]:
values = [12, 300]
pd.Series(data = values, index = dtindex)

2016-01-02     12
2019-09-17    300
dtype: int64

## The pd.to_datetime() Method

In [47]:
pd.to_datetime("2010-09-5")
pd.to_datetime(dt.date(2010, 3,4))
pd.to_datetime(["2015-01-03", "2013/4/6", "July 4th, 1996", "2019"])

DatetimeIndex(['2015-01-03', '2013-04-06', '1996-07-04', '2019-01-01'], dtype='datetime64[ns]', freq=None)

In [49]:
times = pd.Series(["2015-01-03", "2013/4/6", "July 4th, 1996", "2019"])
times

0        2015-01-03
1          2013/4/6
2    July 4th, 1996
3              2019
dtype: object

In [50]:
pd.to_datetime(times)

0   2015-01-03
1   2013-04-06
2   1996-07-04
3   2019-01-01
dtype: datetime64[ns]

In [52]:
dates = pd.Series(["July 4th, 2015", "2010/04/5", "Hello", "2015-02-31"])
dates

0    July 4th, 2015
1         2010/04/5
2             Hello
3        2015-02-31
dtype: object

In [53]:
pd.to_datetime(dates, errors = "coerce")
##NaT =  not a time

0   2015-07-04
1   2010-04-05
2          NaT
3          NaT
dtype: datetime64[ns]

In [ ]:
pd.to_datetime(dates, errors = "coerce")

In [60]:
pd.to_datetime([1349720105, 1349806505, 134989205, 1349979305, 1349979305], unit = "s")
##Unix time

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '1974-04-12 09:00:05', '2012-10-11 18:15:05',
               '2012-10-11 18:15:05'],
              dtype='datetime64[ns]', freq=None)

## Create Range of Dates with the pd.date_range() Method

In [61]:
pd.date_range(start= "2015-09-05", end="2015-09-15", freq= "D")

DatetimeIndex(['2015-09-05', '2015-09-06', '2015-09-07', '2015-09-08',
               '2015-09-09', '2015-09-10', '2015-09-11', '2015-09-12',
               '2015-09-13', '2015-09-14', '2015-09-15'],
              dtype='datetime64[ns]', freq='D')

In [63]:
pd.date_range(start= "2015-09-05", end="2015-12-15", freq= "M")

DatetimeIndex(['2015-09-30', '2015-10-31', '2015-11-30'], dtype='datetime64[ns]', freq='M')

In [64]:
pd.date_range(start= "2015-09-05", end="2015-09-15", freq= "2D")

DatetimeIndex(['2015-09-05', '2015-09-07', '2015-09-09', '2015-09-11',
               '2015-09-13', '2015-09-15'],
              dtype='datetime64[ns]', freq='2D')

In [66]:
pd.date_range(start= "2015-09-05", end="2015-12-15", freq= "B")
## B - business days
## W - week from sunday to sunday
## W-FRI - weeks starting with friday
## H - hour
## 6H - every 6 hours
## M - mounth end (last day of each mounth)
## MS - mounth start
## A - Year end

DatetimeIndex(['2015-09-07', '2015-09-08', '2015-09-09', '2015-09-10',
               '2015-09-11', '2015-09-14', '2015-09-15', '2015-09-16',
               '2015-09-17', '2015-09-18', '2015-09-21', '2015-09-22',
               '2015-09-23', '2015-09-24', '2015-09-25', '2015-09-28',
               '2015-09-29', '2015-09-30', '2015-10-01', '2015-10-02',
               '2015-10-05', '2015-10-06', '2015-10-07', '2015-10-08',
               '2015-10-09', '2015-10-12', '2015-10-13', '2015-10-14',
               '2015-10-15', '2015-10-16', '2015-10-19', '2015-10-20',
               '2015-10-21', '2015-10-22', '2015-10-23', '2015-10-26',
               '2015-10-27', '2015-10-28', '2015-10-29', '2015-10-30',
               '2015-11-02', '2015-11-03', '2015-11-04', '2015-11-05',
               '2015-11-06', '2015-11-09', '2015-11-10', '2015-11-11',
               '2015-11-12', '2015-11-13', '2015-11-16', '2015-11-17',
               '2015-11-18', '2015-11-19', '2015-11-20', '2015-11-23',
               '2015-11-24', '2015-11-25', '2015-11-26', '2015-11-27',
               '2015-11-30', '2015-12-01', '2015-12-02', '2015-12-03',
               '2015-12-04', '2015-12-07', '2015-12-08', '2015-12-09',
               '2015-12-10', '2015-12-11', '2015-12-14', '2015-12-15'],
              dtype='datetime64[ns]', freq='B')

In [67]:
pd.date_range(start= "2012-09-09", periods = 25, freq= "D")
##periods - number of results that we want to get

DatetimeIndex(['2012-09-09', '2012-09-10', '2012-09-11', '2012-09-12',
               '2012-09-13', '2012-09-14', '2012-09-15', '2012-09-16',
               '2012-09-17', '2012-09-18', '2012-09-19', '2012-09-20',
               '2012-09-21', '2012-09-22', '2012-09-23', '2012-09-24',
               '2012-09-25', '2012-09-26', '2012-09-27', '2012-09-28',
               '2012-09-29', '2012-09-30', '2012-10-01', '2012-10-02',
               '2012-10-03'],
              dtype='datetime64[ns]', freq='D')

In [68]:
len(pd.date_range(start= "2012-09-09", periods = 25, freq= "D"))

25

In [70]:
pd.date_range(end= "2018-11-03", periods = 23, freq= "W-SUN")

DatetimeIndex(['2018-05-27', '2018-06-03', '2018-06-10', '2018-06-17',
               '2018-06-24', '2018-07-01', '2018-07-08', '2018-07-15',
               '2018-07-22', '2018-07-29', '2018-08-05', '2018-08-12',
               '2018-08-19', '2018-08-26', '2018-09-02', '2018-09-09',
               '2018-09-16', '2018-09-23', '2018-09-30', '2018-10-07',
               '2018-10-14', '2018-10-21', '2018-10-28'],
              dtype='datetime64[ns]', freq='W-SUN')

## The .dt Accessor

In [73]:
dates = pd.date_range(start = "2000-01-01", end = "2010-12-31", freq = "24D")
dates

DatetimeIndex(['2000-01-01', '2000-01-25', '2000-02-18', '2000-03-13',
               '2000-04-06', '2000-04-30', '2000-05-24', '2000-06-17',
               '2000-07-11', '2000-08-04',
               ...
               '2010-05-20', '2010-06-13', '2010-07-07', '2010-07-31',
               '2010-08-24', '2010-09-17', '2010-10-11', '2010-11-04',
               '2010-11-28', '2010-12-22'],
              dtype='datetime64[ns]', length=168, freq='24D')

In [76]:
s = pd.Series(dates)
s.head()

0   2000-01-01
1   2000-01-25
2   2000-02-18
3   2000-03-13
4   2000-04-06
dtype: datetime64[ns]

In [83]:
s[s.dt.is_month_end]

5     2000-04-30
57    2003-09-30
71    2004-08-31
90    2005-11-30
123   2008-01-31
161   2010-07-31
dtype: datetime64[ns]

## Import Financial Data Set with pandas_datareader Library

In [2]:
import pandas as pd

In [2]:
from pandas_datareader import data

In [7]:
company = "MSFT"
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name = company, data_source= "yahoo", start = start, end = end)
stocks.head()

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.100000  30.590000  30.620001  30.950001  38409100.0  24.443624
2010-01-05  31.100000  30.639999  30.850000  30.959999  49749600.0  24.451517
2010-01-06  31.080000  30.520000  30.879999  30.770000  58182400.0  24.301458
2010-01-07  30.700001  30.190001  30.629999  30.450001  50559700.0  24.048725
2010-01-08  30.879999  30.240000  30.280001  30.660000  51197400.0  24.214581

In [11]:
stocks.values
stocks.columns
stocks.index
stocks.axes

[DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
                '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
                '2010-01-14', '2010-01-15',
                ...
                '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
                '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
                '2017-12-28', '2017-12-29'],
               dtype='datetime64[ns]', name='Date', length=2013, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

## Selecting Rows from a DataFrame with a DateTimeIndex

In [12]:
stocks.loc["2014-03-04"]

High         3.848000e+01
Low          3.807000e+01
Open         3.820000e+01
Close        3.841000e+01
Volume       2.680240e+07
Adj Close    3.393059e+01
Name: 2014-03-04 00:00:00, dtype: float64

In [13]:
stocks.iloc[0]

High         3.110000e+01
Low          3.059000e+01
Open         3.062000e+01
Close        3.095000e+01
Volume       3.840910e+07
Adj Close    2.444362e+01
Name: 2010-01-04 00:00:00, dtype: float64

In [14]:
stocks.head()

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.100000  30.590000  30.620001  30.950001  38409100.0  24.443624
2010-01-05  31.100000  30.639999  30.850000  30.959999  49749600.0  24.451517
2010-01-06  31.080000  30.520000  30.879999  30.770000  58182400.0  24.301458
2010-01-07  30.700001  30.190001  30.629999  30.450001  50559700.0  24.048725
2010-01-08  30.879999  30.240000  30.280001  30.660000  51197400.0  24.214581

In [15]:
stocks.loc["2013-10-01": "2013-10-07"]

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  29.221472
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  29.517340
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  29.465128
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  29.482533
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.977814

In [28]:
day = pd.date_range(start="1991-04-12", end= "2017-12-31", freq= "Y")

In [30]:
mask = stocks.index.isin(day)
stocks.loc[mask]

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-12-31  27.920000  27.629999  27.799999  27.910000  24752000.0  22.501787
2012-12-31  26.770000  26.370001  26.590000  26.709999  42749500.0  22.731602
2013-12-31  37.580002  37.220001  37.400002  37.410000  17503500.0  32.801250
2014-12-31  47.439999  46.450001  46.730000  46.450001  21552500.0  41.842781
2015-12-31  56.189999  55.419998  56.040001  55.480000  27334100.0  51.337688

## Timestamp Object Attributes

In [31]:
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.443624
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.451517
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.301458

In [33]:
someday = stocks.index[500]

In [38]:
someday.day_name
someday.weekday_name
someday.week
someday.is_month_end

C:\Users\alogu\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: `weekday_name` is deprecated and will be removed in a future version. Use `day_name` instead

False

In [42]:
stocks.insert(0, "Day of week", stocks.index.weekday_name)

In [43]:
stocks

,Day of week,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,
2010-01-04,Monday,31.100000,30.590000,30.620001,30.950001,38409100.0,24.443624
2010-01-05,Tuesday,31.100000,30.639999,30.850000,30.959999,49749600.0,24.451517
2010-01-06,Wednesday,31.080000,30.520000,30.879999,30.770000,58182400.0,24.301458
2010-01-07,Thursday,30.700001,30.190001,30.629999,30.450001,50559700.0,24.048725
2010-01-08,Friday,30.879999,30.240000,30.280001,30.660000,51197400.0,24.214581
...,...,...,...,...,...,...,...
2017-12-22,Friday,85.629997,84.919998,85.400002,85.510002,14145800.0,83.112022
2017-12-26,Tuesday,85.529999,85.029999,85.309998,85.400002,9891200.0,83.005104
2017-12-27,Wednesday,85.980003,85.220001,85.650002,85.709999,14678000.0,83.306412
2017-12-28,Thursday,85.930000,85.550003,85.900002,85.720001,10594300.0,83.316124
2017-12-29,Friday,86.050003,85.500000,85.629997,85.540001,18717400.0,83.141182

In [44]:
stocks.insert(1, "Is Start of Mounth", stocks.index.is_month_start)

In [46]:
stocks[stocks["Is Start of Mounth"]]

,Day of week,Is Start of Mounth,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-02-01,Monday,True,28.480000,27.920000,28.389999,28.410000,85931100.0,22.437580
2010-03-01,Monday,True,29.049999,28.530001,28.770000,29.020000,43805400.0,23.026525
2010-04-01,Thursday,True,29.540001,28.620001,29.350000,29.160000,74768100.0,23.137602
2010-06-01,Tuesday,True,26.309999,25.520000,25.530001,25.889999,76152400.0,20.635656
2010-07-01,Thursday,True,23.320000,22.730000,23.090000,23.160000,92239400.0,18.459715
...,...,...,...,...,...,...,...,...
2017-06-01,Thursday,True,70.610001,69.449997,70.239998,70.099998,21603600.0,67.434410
2017-08-01,Tuesday,True,73.419998,72.489998,73.099998,72.580002,22132300.0,69.820122
2017-09-01,Friday,True,74.739998,73.639999,74.709999,73.940002,21736200.0,71.507362
2017-11-01,Wednesday,True,83.760002,82.879997,83.680000,83.180000,22307400.0,80.443352
2017-12-01,Friday,True,84.809998,83.220001,83.599998,84.260002,29532100.0,81.897079

## The .truncate() Method

In [47]:
company = "MSFT"
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name = company, data_source= "yahoo", start = start, end = end)
stocks.head()

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.100000  30.590000  30.620001  30.950001  38409100.0  24.443624
2010-01-05  31.100000  30.639999  30.850000  30.959999  49749600.0  24.451517
2010-01-06  31.080000  30.520000  30.879999  30.770000  58182400.0  24.301458
2010-01-07  30.700001  30.190001  30.629999  30.450001  50559700.0  24.048725
2010-01-08  30.879999  30.240000  30.280001  30.660000  51197400.0  24.214581

In [48]:
stocks.truncate(before = "2011-02-05", after = "2011-02-28")

                 High        Low       Open      Close      Volume  Adj Close
Date
2011-02-07  28.340000  27.790001  27.799999  28.200001  68980900.0  22.735588
2011-02-08  28.340000  28.049999  28.100000  28.280001  34904200.0  22.800087
2011-02-09  28.260000  27.910000  28.190001  27.969999  52905100.0  22.550152
2011-02-10  27.940001  27.290001  27.930000  27.500000  76672400.0  22.171234
2011-02-11  27.809999  27.070000  27.760000  27.250000  83939700.0  21.969673
2011-02-14  27.270000  26.950001  27.209999  27.230000  56766200.0  21.953550
2011-02-15  27.330000  26.950001  27.040001  26.959999  44116500.0  21.864336
2011-02-16  27.070000  26.600000  27.049999  27.020000  70817900.0  21.912996
2011-02-17  27.370001  26.910000  26.969999  27.209999  57207300.0  22.067087
2011-02-18  27.209999  26.990000  27.129999  27.059999  68667800.0  21.945433
2011-02-22  27.100000  26.520000  26.780001  26.590000  60889000.0  21.564276
2011-02-23  26.860001  26.430000  26.530001  26.590000  60234100.0  21.564276
2011-02-24  27.059999  26.500000  26.639999  26.770000  64494200.0  21.710251
2011-02-25  26.950001  26.500000  26.910000  26.549999  53006300.0  21.531834
2011-02-28  26.860001  26.510000  26.690001  26.580000  51379900.0  21.556164

## pd.DateOffset Objects

In [52]:
stocks = data.DataReader(name = "GOOG", data_source= "yahoo", 
               start = dt.date(2000,1,1), end = dt.datetime.now())
stocks.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813286  49.982655  44871300.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942800.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342800.0  54.495735

In [55]:
stocks.index + pd.DateOffset(weeks = 2)

DatetimeIndex(['2004-09-02', '2004-09-03', '2004-09-06', '2004-09-07',
               '2004-09-08', '2004-09-09', '2004-09-10', '2004-09-13',
               '2004-09-14', '2004-09-15',
               ...
               '2019-11-04', '2019-11-05', '2019-11-06', '2019-11-07',
               '2019-11-08', '2019-11-11', '2019-11-12', '2019-11-13',
               '2019-11-14', '2019-11-15'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

In [56]:
stocks.index - pd.DateOffset(days = 2)

DatetimeIndex(['2004-08-17', '2004-08-18', '2004-08-21', '2004-08-22',
               '2004-08-23', '2004-08-24', '2004-08-25', '2004-08-28',
               '2004-08-29', '2004-08-30',
               ...
               '2019-10-19', '2019-10-20', '2019-10-21', '2019-10-22',
               '2019-10-23', '2019-10-26', '2019-10-27', '2019-10-28',
               '2019-10-29', '2019-10-30'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

In [60]:
stocks.index + pd.DateOffset(years = 2)
stocks.index + pd.DateOffset(months = 2)

DatetimeIndex(['2004-10-19', '2004-10-20', '2004-10-23', '2004-10-24',
               '2004-10-25', '2004-10-26', '2004-10-27', '2004-10-30',
               '2004-10-31', '2004-11-01',
               ...
               '2019-12-21', '2019-12-22', '2019-12-23', '2019-12-24',
               '2019-12-25', '2019-12-28', '2019-12-29', '2019-12-30',
               '2019-12-31', '2020-01-01'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

In [63]:
stocks.index + pd.DateOffset(hours = 6)
stocks.index + pd.DateOffset(years = 1, months = 4, weeks = 2, hours = 5)

DatetimeIndex(['2006-01-02 05:00:00', '2006-01-03 05:00:00',
               '2006-01-06 05:00:00', '2006-01-07 05:00:00',
               '2006-01-08 05:00:00', '2006-01-09 05:00:00',
               '2006-01-10 05:00:00', '2006-01-13 05:00:00',
               '2006-01-14 05:00:00', '2006-01-15 05:00:00',
               ...
               '2021-03-07 05:00:00', '2021-03-08 05:00:00',
               '2021-03-09 05:00:00', '2021-03-10 05:00:00',
               '2021-03-11 05:00:00', '2021-03-14 05:00:00',
               '2021-03-14 05:00:00', '2021-03-14 05:00:00',
               '2021-03-14 05:00:00', '2021-03-15 05:00:00'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

In [64]:
stocks.head()

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813286  49.982655  44871300.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942800.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342800.0  54.495735
2004-08-24  55.591629  51.591621  55.412300  52.239193  15319700.0  52.239193
2004-08-25  53.798351  51.746044  52.284027  52.802086   9232100.0  52.802086

In [66]:
stocks.index + pd.tseries.offsets.MonthEnd()
##look for the next available mounth end
stocks.index + pd.tseries.offsets.MonthBegin()

DatetimeIndex(['2004-09-01', '2004-09-01', '2004-09-01', '2004-09-01',
               '2004-09-01', '2004-09-01', '2004-09-01', '2004-09-01',
               '2004-09-01', '2004-10-01',
               ...
               '2019-11-01', '2019-11-01', '2019-11-01', '2019-11-01',
               '2019-11-01', '2019-11-01', '2019-11-01', '2019-11-01',
               '2019-11-01', '2019-12-01'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

In [3]:
from pandas.tseries.offsets import *
## *all methods

In [70]:
stocks.index + MonthBegin()
stocks.index + BMonthEnd()

DatetimeIndex(['2004-08-31', '2004-08-31', '2004-08-31', '2004-08-31',
               '2004-08-31', '2004-08-31', '2004-08-31', '2004-08-31',
               '2004-09-30', '2004-09-30',
               ...
               '2019-10-31', '2019-10-31', '2019-10-31', '2019-10-31',
               '2019-10-31', '2019-10-31', '2019-10-31', '2019-10-31',
               '2019-11-29', '2019-11-29'],
              dtype='datetime64[ns]', name='Date', length=3829, freq=None)

##  The pandas Timedelta Object

In [ ]:
##not specifical moment in time
##duration until moment

In [11]:
timea = pd.Timestamp("2016-03-31 04:35 PM")
timea

Timestamp('2016-03-31 16:35:00')

In [10]:
timeb = pd.Timestamp("2016-03-20 02:16:49 AM")

In [12]:
timea - timeb

Timedelta('11 days 14:18:11')

In [13]:
timeb - timea

Timedelta('-12 days +09:41:49')

In [18]:
pd.Timedelta(days = 3, minutes = 45, hours = 8, weeks = 3)

Timedelta('24 days 08:45:00')

In [19]:
pd.Timedelta("5 minutes")

Timedelta('0 days 00:05:00')

## Timedeltas in a Dataset

In [23]:
shipping = pd.read_csv("ecommerce.csv", index_col = "ID", parse_dates = ["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [26]:
shipping["delivery_time"] = shipping["delivery_date"] - shipping["order_date"]
shipping

    order_date delivery_date delivery_time
ID
1   1998-05-24    1999-02-05      257 days
2   1992-04-22    1998-03-06     2144 days
4   1991-02-10    1992-08-26      563 days
5   1992-07-21    1997-11-20     1948 days
7   1993-09-02    1998-06-10     1742 days
..         ...           ...           ...
990 1991-06-24    1996-02-02     1684 days
991 1991-09-09    1998-03-30     2394 days
993 1990-11-16    1998-04-27     2719 days
994 1993-06-03    1993-06-13       10 days
997 1990-01-04    1991-10-03      637 days

[501 rows x 3 columns]

In [29]:
shipping["twice_as_long"] = shipping["delivery_date"] + shipping["delivery_time"]

In [30]:
shipping

    order_date delivery_date delivery_time twice_as_long
ID
1   1998-05-24    1999-02-05      257 days    1999-10-20
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
..         ...           ...           ...           ...
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
994 1993-06-03    1993-06-13       10 days    1993-06-23
997 1990-01-04    1991-10-03      637 days    1993-07-01

[501 rows x 4 columns]

In [32]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
delivery_time    timedelta64[ns]
twice_as_long     datetime64[ns]
dtype: object

In [35]:
mask = shipping["delivery_time"] > "365 days"
shipping[mask]

    order_date delivery_date delivery_time twice_as_long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
..         ...           ...           ...           ...
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]

In [36]:
shipping["delivery_time"].min()

Timedelta('8 days 00:00:00')

In [37]:
companies = ["MSFT", "GOOG", "YHOO", "AMZN"]
data.DataReader(name = companies, data_source= "yahoo")

C:\Users\alogu\Anaconda3\lib\site-packages\pandas_datareader\base.py:270: SymbolWarning: Failed to read symbol: 'YHOO', replacing with NaN.
  warnings.warn(msg.format(sym), SymbolWarning)

Attributes   Adj Close                                      Close  \
Symbols           MSFT         GOOG         AMZN YHOO        MSFT
Date
2014-11-05   42.842709   544.425293   296.519989  NaN   47.860001
2014-11-06   43.594646   540.555908   296.640015  NaN   48.700001
2014-11-07   43.576752   539.528748   299.859985  NaN   48.680000
2014-11-10   43.764729   545.990967   305.109985  NaN   48.889999
2014-11-11   43.746830   548.783325   312.010010  NaN   48.869999
...                ...          ...          ...  ...         ...
2019-10-29  142.830002  1262.619995  1762.709961  NaN  142.830002
2019-10-30  144.610001  1261.290039  1779.989990  NaN  144.610001
2019-10-31  143.369995  1260.109985  1776.660034  NaN  143.369995
2019-11-01  143.720001  1273.739990  1791.439941  NaN  143.720001
2019-11-04  144.449997  1286.719971  1812.689941  NaN  144.449997

Attributes                                       High               ...  \
Symbols            GOOG         AMZN YHOO        MSFT         GOOG  ...
Date                                                                ...
2014-11-05   544.425293   296.519989  NaN   47.900002   555.275513  ...
2014-11-06   540.555908   296.640015  NaN   48.860001   545.387634  ...
2014-11-07   539.528748   299.859985  NaN   48.919998   544.714478  ...
2014-11-10   545.990967   305.109985  NaN   49.150002   548.085205  ...
2014-11-11   548.783325   312.010010  NaN   48.950001   550.428772  ...
...                 ...          ...  ...         ...          ...  ...
2019-10-29  1262.619995  1762.709961  NaN  144.500000  1281.589966  ...
2019-10-30  1261.290039  1779.989990  NaN  145.000000  1269.359985  ...
2019-10-31  1260.109985  1776.660034  NaN  144.929993  1267.670044  ...
2019-11-01  1273.739990  1791.439941  NaN  144.419998  1274.619995  ...
2019-11-04  1286.719971  1812.689941  NaN  144.994995  1289.675049  ...

Attributes          Low             Open                                 \
Symbols            AMZN YHOO        MSFT         GOOG         AMZN YHOO
Date
2014-11-05   294.160004  NaN   47.799999   555.275513   303.010010  NaN
2014-11-06   292.290009  NaN   47.860001   544.006409   296.690002  NaN
2014-11-07   296.290009  NaN   48.919998   544.714478   297.820007  NaN
2014-11-10   300.000000  NaN   48.650002   539.977478   300.000000  NaN
2014-11-11   303.649994  NaN   48.849998   546.988220   305.940002  NaN
...                 ...  ...         ...          ...          ...  ...
2019-10-29  1755.810059  NaN  144.080002  1276.229980  1774.810059  NaN
2019-10-30  1759.119995  NaN  143.520004  1252.969971  1760.239990  NaN
2019-10-31  1771.479980  NaN  144.899994  1261.280029  1775.989990  NaN
2019-11-01  1785.209961  NaN  144.259995  1265.000000  1788.010010  NaN
2019-11-04  1801.010010  NaN  144.830002  1276.449951  1801.010010  NaN

Attributes      Volume
Symbols           MSFT       GOOG       AMZN YHOO
Date
2014-11-05  22449600.0  2032200.0  4674500.0  NaN
2014-11-06  33037800.0  1333200.0  3758100.0  NaN
2014-11-07  28000600.0  1633700.0  2647400.0  NaN
2014-11-10  36370100.0  1134600.0  2809100.0  NaN
2014-11-11  23445200.0   965500.0  3803600.0  NaN
...                ...        ...        ...  ...
2019-10-29  20519700.0  1869200.0  2273700.0  NaN
2019-10-30  18471700.0  1407700.0  2442400.0  NaN
2019-10-31  24596200.0  1454700.0  2779100.0  NaN
2019-11-01  33119200.0  1669400.0  2788700.0  NaN
2019-11-04   5397168.0   497476.0  1264277.0  NaN

[1258 rows x 24 columns]